Revit 2027 API
Connector.Width Property
The width of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual double Width { get; set; }
Public Overridable Property Width As Double
	Get
	Set
public:
virtual property double Width {
	double get ();
	void set (double value);
}
abstract Width : float with get, set
override Width : float with get, set
Property Value
Double
Implements
IConnector.Width
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's shape is not rectangular.
ArgumentException |  Thrown when the argument is invalid.
InvalidOperationException |  Thrown on failure to set width.
Remarks
In order to set this property, it must be mapped to a writable instance parameter in the family definition.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace